{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v3.21.0",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_7",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_13",
              "trainable": true,
              "batch_input_shape": [null, 28, 28, 1],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": { "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_37",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
              "moving_variance_initializer": { "class_name": "Ones", "config": {} },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_13",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_14",
              "trainable": true,
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": { "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_38",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
              "moving_variance_initializer": { "class_name": "Ones", "config": {} },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_14",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout_25", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null }
          },
          { "class_name": "Flatten", "config": { "name": "flatten_7", "trainable": true, "data_format": "channels_last" } },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_31",
              "trainable": true,
              "units": 1568,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": { "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_39",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
              "moving_variance_initializer": { "class_name": "Ones", "config": {} },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout_26", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_32",
              "trainable": true,
              "units": 784,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": { "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_40",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
              "moving_variance_initializer": { "class_name": "Ones", "config": {} },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_33",
              "trainable": true,
              "units": 27,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": { "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "optimizer_config": { "class_name": "Adadelta", "config": { "lr": 1.0, "rho": 0.95, "decay": 0.0, "epsilon": 1e-7 } },
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"],
      "weights": [
        { "name": "batch_normalization_37/gamma", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization_37/beta", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization_37/moving_mean", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization_37/moving_variance", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization_38/gamma", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_38/beta", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_38/moving_mean", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_38/moving_variance", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_39/gamma", "shape": [1568], "dtype": "float32" },
        { "name": "batch_normalization_39/beta", "shape": [1568], "dtype": "float32" },
        { "name": "batch_normalization_39/moving_mean", "shape": [1568], "dtype": "float32" },
        { "name": "batch_normalization_39/moving_variance", "shape": [1568], "dtype": "float32" },
        { "name": "batch_normalization_40/gamma", "shape": [784], "dtype": "float32" },
        { "name": "batch_normalization_40/beta", "shape": [784], "dtype": "float32" },
        { "name": "batch_normalization_40/moving_mean", "shape": [784], "dtype": "float32" },
        { "name": "batch_normalization_40/moving_variance", "shape": [784], "dtype": "float32" },
        { "name": "conv2d_13/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "conv2d_13/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv2d_14/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2d_14/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_31/kernel", "shape": [1600, 1568], "dtype": "float32" },
        { "name": "dense_31/bias", "shape": [1568], "dtype": "float32" },
        { "name": "dense_32/kernel", "shape": [1568, 784], "dtype": "float32" },
        { "name": "dense_32/bias", "shape": [784], "dtype": "float32" },
        { "name": "dense_33/kernel", "shape": [784, 27], "dtype": "float32" },
        { "name": "dense_33/bias", "shape": [27], "dtype": "float32" }
      ]
    }
  ]
}
